bench/rheotool/extensional_fenep_ve_planar/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// FENE-P (Peterlin) planar-extension material test, matched to Kraken's 3D
// FVFD FENE-P extensional canary (run_viscoelastic_fvfd_extensional_3d with
// LogConfFENEP, test_fvfd_fenep_extensional_3d.jl, gate G2):
//
//   beta   = etaS/(etaS+etaP) = 0.5   (etaS = etaP = 0.05)
//   lambda = 50 ,  epsilon_dot = 0.005  ->  2*lambda*epsilon_dot = 0.5
//   L2     = 50   (finite extensibility, same as the Kraken canary)
//
// FENE-P has NO closed-form planar-extension fixed point (transcendental in
// trC), so this case is a RheoTool-vs-Kraken CROSS-VALIDATION at matched
// parameters (both numerical). Kraken's center C_xx ~ 1.944, trC ~ 3.60.
//
// As L2 -> infinity the FENE-P spring becomes Hookean and the result must
// recover the Oldroyd-B planar fixed point C_xx = 1/(1-2*lambda*eps_dot) = 2.
//
// rheoTestFoam (solveInTau false) transports the conformation tensor A with
// equilibrium A = a*I, a = L2/(L2-3), Peterlin varf = 1/(1 - trA/L2). The
// reported total extra-stress is
//   tau_total = tau_p + etaS*(L + L^T - (2/3) tr(L) I),
//   tau_p     = (etaP/lambda)*(varf*A - a*I).
// Kraken's conformation C relates to RheoTool's A by C = A/a (both have the
// same physical polymer stress and the same Peterlin trace cap trC < L2).
//
// rheoTestFoam imposes nabla(U) = gradU * gammaEpsilonDotL[0]. The planar
// extension tensor diag(1,-1,0) gives U = (eps_dot*x, -eps_dot*y, 0), i.e.
// exactly the velocity field Kraken imposes (velocity_mode=:imposed).

parameters
{
                type             FENE-P;

                etaS             etaS [1 -1 -1 0 0 0 0] 0.05;
                etaP             etaP [1 -1 -1 0 0 0 0] 0.05;
                lambda           lambda [0 0 1 0 0 0 0] 50;
                L2               L2 [0 0 0 0 0 0 0] 50;
                solveInTau       false;
                modifiedForm     false;

                stabilization    none;
                rho              rho [1 -3 0 0 0 0 0] 0.;
}

rheoTestFoamParameters
{
              // Transient single-rate mode (only first gammaEpsilonDotL read)
                ramp             false;

              // Planar extension: nabla(U) = gammaEpsilonDot * diag(1,-1,0)
                gradU            ( 1.    0.    0.
                                   0.   -1.    0.
                                   0.    0.    0. );

              // Imposed extensional rate epsilon_dot (1/s)
                gammaEpsilonDotL
                  (
                        0.005
                  );
}
// ************************************************************************* //
