bench/rheotool/extensional_fenep_ve_planar/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         CrankNicolson 1;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss upwind; //Dummy: select anyone (phi=0)
}

laplacianSchemes
{
    default         none;      
}

interpolationSchemes
{
    default         linear;
      
}

snGradSchemes
{
    default         orthogonal;
}

fluxRequired
{
    default         no;
}

// ************************************************************************* //
